Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་ངེས་པར་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Teaching on the Great Compassion of the Tathāgata

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི། སྔོན་རྒྱལ་བ་བཞུགས་བཞུགས་པའི་མཆོད་རྟེན་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བརླབས་པ་སའི་སྙིང་པོ།
en: The Blessed One was dwelling on Vulture Peak, near Rājagṛha, a sacred site blessed by tathāgatas, a great stūpa where previous victors dwelled.

source: བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་བསྟོད་པ། ཆོས་ཀྱི་གདན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་གྱིས་ཕྱག་བྱས་པའི་ས་ཕྱོགས། དགེ་བའི་རྩ་བ་ཡང་དག་པར་སྐུལ་བ།
en: It is a Dharma seat praised by bodhisattvas and a place worshiped by gods, nāgas, yakṣas, gandharvas, and asuras that inspires toward roots of virtue.

source: དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་ཆོས་ཀྱི་སྒོ་མངོན་པར་བརྗོད་པ། བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བ། ཡོན་ཏན་ཚད་མེད་པ་ལས་ཡང་དག་པར་བྱུང་བ།
en: It is a site where tathāgatas appear and where gateways to the Dharma are promulgated, where bodhisattvas appear and where infinite qualities spring forth.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ན། བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ནི་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: In the tathāgata domain, the Blessed One had fully realized the sameness of all phenomena.

source: ཆོས་ཀྱི་འཁོར་ལོ་ནི་ཤིན་ཏུ་བསྐོར། སློབ་མ་ཤིན་ཏུ་དུལ་བ་མཐའ་ཡས་པའི་ཚོགས་ནི་མངའ།
en: He had turned the wheel of the Dharma and now commanded a vast host of well-trained disciples.

source: ཆོས་ཐམས་ཅད་ལ་མངའ་དབང་ནི་བརྙེས།
en: He had achieved mastery over all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་སྒྲུབ་པ་ནི་ལེགས་པར་མཁྱེན། དབང་པོ་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བརྙེས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ལེགས་པར་འཇོམས་པ་ལ་ནི་མཁས།
en: He knew well how to fulfill the intentions of all beings, he had discovered how to bring their faculties to the highest perfection, and he had become skillful in terminating their karmic traces.

source: སངས་རྒྱས་ཀྱི་མཛད་པ་ལྷུན་གྱིས་གྲུབ་པ་ནི་རྒྱུན་མི་འཆད་ཅིང་དགེ་སློང་སྟོང་ཕྲག་དྲུག་ཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: In his spontaneous and uninterrupted buddha activity, he resided in the company of a large saṅgha of sixty thousand monks.

source: ཐམས་ཅད་ཀྱང་ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: All of these monks were of noble lineage, mighty elephants who had done their duties and performed their tasks. They had laid down the burden of existence and attained their own goals for themselves. They had brought their entanglement in existence to an end.

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ལེགས་པར་བཅོམ་པ།
en: Their minds were liberated through perfect knowledge and insight, and they had brought the karmic traces of afflictive emotions to an end.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་རྒྱལ་པོའི་སྲས། ཆོས་ཟབ་མོ་ལ་གནས་པར་མཁས་པ།
en: These sons of the Dharma king, the Tathāgata, were skillfully established in the profound Dharma.

source: དམིགས་པ་མེད་པའི་ཆོས་ཀྱིས་ངེས་པར་བྱུང་བ།
en: They were emancipated through the teaching on non-objectification.

source: སྤྱོད་ལམ་མཛེས་པ་ཕུན་སུམ་ཚོགས་པ། སྦྱིན་པའི་གནས་ཆེན་པོར་གྱུར་པ། དེ་བཞིན་གཤེགས་པའི་བཀའ་ལ་ཤིན་ཏུ་ཞུགས་པ་ཤ་སྟག་གོ། །
en: They had exquisite and elegant comportments, were great objects of veneration, and were fully grounded in the tathāgata word.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དང་ཡང་ཐབས་ཅིག་སྟེ།
en: Furthermore, the Blessed One resided in the company of a vast saṅgha of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པ་ཆགས་པ་མེད་པའི་སྤྱོད་ཡུལ་གྱིས་ངེས་པར་བྱུང་བ།
en: These bodhisattva mahāsattvas were all-knowing and had achieved perfection through dispassionate conduct.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཆོས་ཀྱི་སྤྲིན་ལས་ལྷག་མཐོང་དང་། རིག་པ་དང་། རྣམ་པར་གྲོལ་བའི་གློག་ཕྱུང་ཞིང་བདུད་རྩིའི་ཆུའི་རྒྱུན་གྱི་ཆར་འབེབས་པས་འགྲོ་བ་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ།
en: From a Dharma cloud of great benevolence and vast compassion, these bodhisattvas sent forth the lightning of special insight, knowledge, and liberation and rained down showers of divine nectar, through which they pleased all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ས་དང་མཉམ་པ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བ།
en: With a disposition that encompasses everyone, like the earth, they felt affection for all sentient beings and lacked hostility.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སྣ་ཚོགས་ཀྱི་ལོ་ཐོག་ཡང་དག་པར་འཕེལ་བར་བྱེད་པ།
en: They increased the crops of the diverse factors of awakening.

source: ཉི་མའི་དཀྱིལ་འཁོར་བས་ལྷག་པའི་ཤེས་རབ་ཀྱི་འོད་ཟེར་རབ་ཏུ་གཏོང་བས་གཏི་མུག་གི་མུན་པ་སེལ་བའི་ལམ་གྱི་སྣང་བ་ཐོབ་པ་ཀུན་ཏུ་སྟོན་པ་དང་།
en: By sending out rays of insight brighter than the sun, they revealed that they had achieved the path of clearing away the darkness of ignorance.

source: སེམས་ཅན་གྱི་པད་མ་ཁ་འབྱེད་པ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སྲེད་པའི་ཆུ་སྐེམས་པ་དང་།
en: They opened sentient beings like lotus flowers, brought the roots of virtue to maturity, and dried up the rivers of craving.

source: ཤེས་པའི་ལས་ཀྱི་མཐའ་ལ་རབ་ཏུ་འཇོག་པ་ལ་མངོན་པར་ཤེས་པ་ཆེན་པོ་དང་། ཞི་གནས་ཀྱིས་རྒྱུ་བ།
en: Focused on the task of knowledge, they were driven by the mighty higher knowledges and tranquil abiding.

source: ཟླ་བ་ལྟ་བུར་འགྲོ་བ་ཐམས་ཅད་ལ་སེམས་མཉམ་པས་མངོན་པར་ཞི་བར་བྱ་བའི་བསམ་པ་ཚིམ་པར་བྱ་བའི་ཐབས་ལ་མཁས་པས་འགྲིབ་པ་དང་འཕེལ་བ་ཀུན་ཏུ་སྟོན་པ།
en: Like the moon, they displayed a waxing and waning in brightness, since their disposition embraced all beings, and they were skilled in the means to pacify and appease them;

source: རི་རབ་ལྟ་བུའི་ལྷག་པའི་བསམ་པས་ཚངས་པའི་གནས་པའི་རིན་པོ་ཆེ་ཤིན་ཏུ་བརྟན་ཏེ
en: with their noble intentions like Mount Meru, the jewels of the Brahmā abodes were firmly established.

source: ངོས་བཞི་ནས་ཡུལ་གྱི་རླུང་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་ཅིང་འཇིག་རྟེན་གྱི་ཆོས་ལས་མངོན་པར་འཕགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀུན་ཏུ་བསྟན་པ་སྣང་བར་གྱུར་པ།
en: They illuminated and displayed all buddhafields, which were superior in quality to our world and never buffeted by gusts of wind from any of the four directions.

source: རྒྱ་མཚོ་ཆེན་པོ་ལྟར་གཟུངས་དང་དྲན་པའི་སྣོད་རྒྱ་ཆེན་པོ་ཆོས་ཀྱི་ཆུས་ཡོངས་སུ་གང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རིན་པོ་ཆེས་འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བ།
en: Like a great ocean, they were vast containers of retention and mindfulness, filled with the water of Dharma, and their precious bodhisattva conduct nourished all beings.

source: རི་དགས་ཀྱི་རྒྱལ་པོ་ལྟར་བདེན་པའི་རྐང་པ་དང་། བྱམས་པ་རབ་ཏུ་འཕེལ་བའི་མཇུག་མ་དང་། ཞི་གནས་དང་ལྷག་མཐོང་གི་མིག་དང་ལྡན་ཞིང་ཆོས་ཟབ་མོ་ལ་སྐྲག་པ་མེད་པས་ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་འཇོམས་པ།
en: Like the king of beasts, they had the legs of truth, a full tail of loving kindness, and eyes of tranquil abiding and special insight, and, since they were unintimidated by the profound Dharma, they subdued all adversaries.

source: བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་ཅིང་མཐའ་ཡས་ཐུག་པ་མེད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱུན་མ་བཅད་པས་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པ་ཤ་སྟག་དང་ཐབས་ཅིག་པ་ལ་འདི་ལྟ་སྟེ།
en: Their bodhisattva conduct remained undisrupted for countless eons, so they were endowed with all qualities.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ནས་སྣང་ཞིང་སྒྲིབ་པ་མེད་པར་ལྟ་བ་ཞེས་བྱ་བ་དང་།
en: including the bodhisattva mahāsattva All-Illumining and Unobstructed Gaze,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞིང་ཐམས་ཅད་ཀྱི་རྒྱུན་བཀོད་པ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་དང་།
en: the bodhisattva mahāsattva All-Revealing Continuous Display of All Buddhafields,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་རིགས་ལས་བྱུང་བའི་སྤྱོད་པའི་བློ་གྲོས་ཞེས་བྱ་བ་དང་།
en: the bodhisattva mahāsattva Intelligence in Conduct Stemming from the Tathāgata Lineage,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་ལམ་ཐམས་ཅད་ཀྱིས་འདུལ་བ་མི་འཁྲུགས་པ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་དང་།
en: the bodhisattva mahāsattva All-Revealing Unperturbed Subjugation through All Conduct,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་མཐའ་ཡས་པའི་ཏོག་གི་རྒྱལ་མཚན་རྣམ་པར་སྤྲུལ་པའི་དབྱངས་ཞེས་བྱ་བ་དང་།
en: the bodhisattva mahāsattva Topping the Victory Banner of Endless Courage with Miraculous Melodies,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གསེར་བཟང་པོ་རྣམ་པར་བསགས་པའི་འོད་ཀྱི་གཟི་བརྗིད་ཀྱི་འོད་ཟེར་ཞེས་བྱ་བ་དང་།
en: the bodhisattva mahāsattva Brilliant Light Rays of the Collection of Fine Gold,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱིས་རྣམ་པར་ངེས་པའི་ཚིག་ལ་སྤོབས་པ་ཞེས་བྱ་བ་དང་།
en: the bodhisattva mahāsattva Eloquence in Language via Insight,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་དཔག་ཏུ་མེད་པས་བརྟན་པས་བསགས་པ་ཞེས་བྱ་བ་དང་།
en: and the bodhisattva mahāsattva Gathering of Stable and Immeasurable Merit and Insight.

source: དེ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་དང་ཐབས་ཅིག་གོ། །
en: Thus the Blessed One dwelled in the company of countless bodhisattva mahāsattvas

source: དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འདུག་པས་ངེས་པར་འབྱུང་བ་སྒྲིབ་པ་མེད་པའི་སྒོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: The Blessed One proceeded to teach the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.

source: དེ་ནས་བཅོམ་ལྡན་འདས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ལོ་བཅུ་དྲུག་བཞེས་ཏེ། ཚངས་པར་སྤྱོད་པ་རྒྱས་པར་གྱུར་པར་མཁྱེན།
en: Sixteen years had passed since the Blessed One had become fully awakened, and he knew that the sacred conduct had unfolded.

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ཆེན་པོ་དེ་ཡང་གཟིགས་ཤིང་མཁྱེན་ཏེ།
en: He beheld the great assembly of bodhisattvas.

source: ཀྱེ་མ་བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་མཛོད་འཛིན་པར་མཁྱེན་ནས་འདི་སྙམ་དུ་
en: Once he had understood these assembled bodhisattvas to be holders of the treasury of tathāgata Dharma, he thought,

source: གང་གི་ཕྱིར་ངས་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་ཆེར་རྗེས་སུ་ཡོངས་སུ་གཟུང་བ་དང་། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་གཟུད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོ་འཕྲུལ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་ངེས་པར་འབྱུང་བ་སྒྲིབ་པ་མེད་པའི་སྒོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡང་དག་པར་བསྟན་པར་བྱའོ་སྙམ་དུ་དགོངས་སོ། །
en: “Because I care deeply for the bodhisattvas, I shall teach the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life, drawing on the magic and miraculous displays of tathāgatas, in order to lead the bodhisattva mahāsattvas to the domain of the Tathāgata.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཡུལ་རྣམ་པར་སྤྲུལ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པར་སྟོན་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Then the Blessed One attained the tathāgata absorption called display of the emanation of the buddha domain exactly as it is.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཡུལ་རྣམ་པར་སྤྲུལ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པར་སྟོན་པ་ཞེས་བྱ་བ་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་སྟེང་གི་བར་སྣང་ལ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་ཀྱི་བར་དུ་འཁོར་གྱི་ཁྱམས། སངས་རྒྱས་ཀྱི་གནས་དེ་བཞིན་གཤེགས་པའི་དགེ་བའི་རྩ་བས་མངོན་པར་གྲུབ་པ།
en: As soon as he had attained that absorption, by his buddha power a pavilion, a veritable buddha abode, appeared in the atmosphere between the desire realm and the form realm. This occurred due to the roots of virtue of the Tathāgata.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཡོངས་སུ་སྦྱོང་བ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བར་བྱེད་པ། སེམས་ཅན་ཚད་མེད་པའི་བསམ་པ་ཚིམ་པར་བྱེད་པ། ལྷའི་གཞལ་མེད་ཁང་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ། ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་སྐུལ་བ།
en: It purified the thinking of bodhisattvas, illuminated the realms of the worlds of the ten directions, fulfilled the aspirations of countless sentient beings, eclipsed the palaces of the gods, and inspired bodhisattvas everywhere.

source: གཞི་བཻ་དཱུརྱ་དཀར་པོའི་དབྱིབས་དང་།
en: This pavilion had a foundation shaped like a white beryl.

source: འཛམ་བུའི་གླིང་གི་གསེར་གྱི་ཁང་པ་དག་དང་། དཔལ་གྱི་སྙིང་པོའི་རྟ་བབས་དག་དང་། རིན་པོ་ཆེ་རྡོའི་སྙིང་པོའི་སྒོ་ཁང་དག་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྙིང་པོའི་ཁ་ཁྱེར་དག་དང་། རིན་པོ་ཆེ་དྲི་མ་མེད་པའི་འོད་ཀྱི་སྟེགས་བུ་དག་དང་།
en: It comprised mansions made of gold extracted from the Jambu River, archways of red gems, portals of emeralds, terraces constructed of jewels, and altars crafted from radiant gems.

source: རིན་པོ་ཆེ་ཀུན་ནས་འོད་ཀྱི་ཁང་པ་བརྩེགས་པ་དག་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་དགབ་པ་དང་། མུ་ཏིག་གི་རྒྱན་ཕྲེང་རབ་ཏུ་སྤྱངས་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྒྲེང་བ་དང་། ལྷའི་དར་གྱི་ལྡ་ལྡི་མངོན་པར་སྤྱངས་པས་བསྔགས་པ་བསྟན་པ་དཔག་ཏུ་མེད་ཅིང་ཐུག་པ་མེད་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཚད་ཙམ་ཞིག་བྱུང་སྟེ
en: Its upper stories consisted of brightly glowing precious stones with coverings of all kinds of jewels and adorned with dangling pearl rosaries, parasols, victory banners, raised standards, and fluttering silk tassels. It was praised and as vast as the extent of the trichiliocosm.

source: འཁོར་གྱི་ཁྱམས་དེ་ཡང་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོས་བསྐུས་པ།
en: The pavilion was anointed with rare and precious sandalwood.

source: ཙན་དན་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་དྲི་ཡིད་དུ་འོང་བ་དང་ལྡན་པ། དྲིའི་མཆོག་ཨ་ག་རུ་དམ་པའི་སྙིང་པོས་བདུགས་པ།
en: It was perfumed with the enchanting fragrance of superior sandalwood. It was scented by the noble essence of aloeswood, the best of fragrances.

source: ཀླུའི་མུ་ཏིག་དང་རིན་པོ་ཆེའི་མེ་ཏོག་གིས་རྣམ་པར་སྤྲས་པ།
en: It was strewn with precious flowers and nāga pearls.

source: མེ་ཏོག་སིལ་མ་བཀྲམ་པ། རིན་པོ་ཆེའི་ཤིང་དང་། རིན་པོ་ཆེའི་མཁའ་རྟེན་གྱིས་མཛེས་པར་བྱས་པ་སྟེ།
en: It was adorned with flower arrangements of scattered flower petals, fine trees, and gorgeous ornaments.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་རྒྱན་མཛེས་པ་བཀོད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་འཁོར་གྱི་ཁྱམས་དེ་ཉིད་ན་ཀུན་ཏུ་སྣང་ངོ་། །
en: The pavilion was everywhere aglitter with variegated arrangements of beautiful ornaments, as many as exist in all the world systems.

source: དེར་གདན་སེང་གེའི་ཁྲི་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དཔག་ཏུ་མེད་པ། གྲངས་མེད་པ། སྣ་ཚོགས་པ། བལྟ་ན་སྡུག་པ། མཐོ་བ། རབ་ཏུ་བཟང་བ། ཡངས་པ། རྒྱ་ཆེ་བ། ཡིད་དུ་འོང་བ། ཡིད་དགའ་བར་བྱེད་པ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: It also featured many strikingly beautiful lion thrones—many tens of billions, countless, of all different kinds, alluring, lofty, superb, broad, and immense.

source: གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཐེམ་སྐས་ཁ་ཁྱེར་མི་བདུན་གྱི་འཕང་ཙམ་གྱིས་བསྐོར་བ། རྒྱར་དཔག་ཚད་ཕྱེད་ཀྱིས་ཡོངས་སུ་བཟུང་བ།
en: In this world system appeared four thousand staircases framed by terraces the height of seven men and half a mile across.

source: རིན་པོ་ཆེ་ཨན་ད་རྙིལ་དང་། མཐོན་ཁ་ཆེན་པོས་སྙིང་པོར་གྱུར་པ། བརྒྱ་བྱིན་ཐོགས་པའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་གདུགས་ཅན། ཚངས་པའི་ནེ་ཙོ་འམ་ཅི་དང་།
en: They were fashioned from precious sapphire and deep blue sapphire and adorned with canopies of all other manner of gems.

source: རིན་པོ་ཆེ་སེར་པོས་སྤྲས་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཁའི་དྲ་བ་ཀུན་ཏུ་བསྐྱོད་པས་སྒྲ་འབྱུང་བ།
en: They were festooned with golden jewels and other precious stones and enveloped by the sound of filigrees of chimes.

source: སའི་སྟེང་ནས་འཁོར་གྱི་ཁྱམས་ལ་ཐུག་གི་བར་དུ་གྱེན་དུ་མངོན་པར་འཕགས་པ། དྲང་བ་མ་ཡོ་བ་བཞི་སྟོང་བྱུང་བར་གྱུར་ཏོ། །
en: These stairways soared from the ground level all the way up to the pavilion. They were straight and steady.

source: གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཡང་དེ་ལྟ་བུའི་ཐེམ་སྐས་ཆེན་པོ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: Just as in this world system, such great staircases rose in all the world systems of the trichiliocosm.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དགོངས་ཤིང་མཁྱེན་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་པར་གྱུར་ཏོ། །
en: At this point the Blessed One mindfully and deliberately emerged from that state of meditative absorption.

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། སྣང་བ་ཆེན་པོ་ཡང་བྱུང་བར་གྱུར་ཏོ། །
en: As soon as he did, the world systems of the trichiliocosm trembled six times and were brightly illuminated.

source: དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་ཐབས་ཅིག །ཉན་ཐོས་ཀྱི་ཚོགས་དང་ཐབས་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་མདུན་དུ་བདར་ཏེ།
en: Then the Blessed One was together with a host of bodhisattvas and a host of śrāvakas, the host of bodhisattvas surrounding him and the host of śrāvakas in front of and behind him.

source: ལྷ་དང་ཀླུས་མངོན་པར་བསྟོད་ཅིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་ནི་འབེབས།
en: Gods and nāgas praised him and caused a great rain of flower petals.

source: ན་བཟའི་ཆར་ཆེན་པོས་ནི་མངོན་པར་འགེབས། ཕྱེ་མ་དང་། །སྤོས་དང་། བྱུག་པའི་ཆར་ཆེན་པོ་ནི་འཐོར། སིལ་སྙན་དང་། སྒྲ་དབྱངས་ཆེན་པོ་ནི་རབ་ཏུ་སྒྲོགས།
en: They bestowed many garments on him and caused a great rain of copious powders, perfumes, and lotions, all to the sound of cymbals and various melodies.

source: འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་ནི་རབ་ཏུ་གཡོ་བར་མཛད།
en: The entire universe shook and lit up brightly.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་ནི་སྣང་བར་མཛད་ཅིང་སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་ཏུ་གྱུར་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་གཟི་བརྗིད་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལས་མི་སྣང་བར་གྱུར་ཏེ
en: Thereupon the whole assembly departed from Vulture Peak through the might of the Buddha: his miraculous powers, miraculous displays, great leadership, blessing, splendor, benediction, and magical abilities.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཕྲག་དུ་མ་ཞབས་འབྲིང་དུ་འབྲང་ཞིང་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཐེམ་སྐས་ཀྱི་དབུས་ནས་འཁོར་གྱི་ཁྱམས་བཀོད་པ་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: Many tens of millions of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas followed in order to attend the Buddha, ascending the central jewel-encrusted staircase leading to the pavilion.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོགས་པ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཐེམ་སྐས་སུ་ཞུགས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་སྟེ་
en: Aware that the Blessed One had proceeded to the staircase, the Catur­mahā­rājakāyika gods, such as the Catur­mahā­rājas, showered clouds of divine flower petals on him in worship.

source: ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་པ།
en: They joined their palms and praised him with the following words:

source: ཉི་ཟླ་མེ་དང་ནོར་བུའི་འོད་དང་ལྷ་ཡུལ་པ་ཡི་ལྷ་འོད་ཤིན་ཏུ་དྲི་མེད་པ། །ཐུབ་པས་འོད་ཀྱིས་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ནས་ངན་སོང་གསུམ་པོ་དག་ཀྱང་ཞི་བར་མཛད། །
en: “The light of the sun, the moon, fire, and jewels, and the immaculate divine light of the heavenly realms, are all outshone by the light of the Capable One, which pacifies the three lower destinies.

source: རི་བོ་ལྷུན་པོ་དང་ནི་ཁོ་ར་ཁོར་ཡུག་རྩེ་མོ་བསྙིལ་ཏེ་ཞིང་རྣམས་གསལ་བར་གྱུར་པས་ན། །
en: This light razes Mount Meru and the surrounding peaks, and it illuminates the buddhafields.

source: དགའ་ཞིང་ཡིད་རྣམས་མགུ་ནས་དོན་རྣམས་ཐམས་ཅད་གྲུབ་པའི་རྒྱལ་བ་ལ་ནི་སྐྱབས་སུ་མཆི། །
en: Therefore, we joyously take refuge in the Victor who has accomplished all aims.”

source: དེ་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་གཤེགས་པའི་ཞབས་འབྲིང་དུ་འབྲང་ངོ་། །
en: After the Catur­mahā­rājakāyika gods had praised the Blessed One with this verse, they joined the procession to attend to him.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་སོགས་པ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཐེམ་སྐས་སུ་ཞུགས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་སྤོས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་སྟེ
en: At this point, the gods of Trāyastriṃśa, such as Śakra, the lord of the gods, became aware that the Blessed One had proceeded to the staircase, and they showered clouds of divine perfume on him in worship.

source: རྫུ་འཕྲུལ་དམ་པ་བརྙེས་ཤིང་རབ་ཏུ་མཚུངས་པ་མེད་པ་རྣམ་པར་འཕྲུལ་པ་ཤིན་ཏུ་སྟོན། །
en: “You attained the most excellent miraculous powers and display unrivaled emanations.

source: རྒྱལ་བ་ཉི་མ་ཇི་བཞིན་འཕགས་ཏེ་ཞིང་རྣམས་བྱེ་བ་བརྒྱ་དག་ཏུ་ཡང་རབ་ཏུ་གདའ། །
en: You rose like the supreme sun pervading vast numbers of buddhafields.

source: རྒྱལ་བས་རང་གི་ཡོན་ཏན་ཀུན་གྱིས་ཞིང་རྣམས་ཐམས་ཅད་བརྒྱན་ཏེ་ཤིན་ཏུ་མཛེས་མཛད་པ། །
en: The Buddha adorns all buddhafields, beautifying them with his own qualities.

source: གང་ཞིག་ཤིན་ཏུ་མཉམ་མེད་མཚུངས་པ་མེད་ཅིང་རྫུ་འཕྲུལ་དབང་དུ་གྱུར་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the unrivaled and unmatched master of miracles!”

source: དེ་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲང་ངོ་། །
en: After the gods of Trāyastriṃśa had praised the Blessed One with this verse, they joined the procession to attend to him.

source: དེ་ནས་ལྷའི་རྒྱལ་པོ་རབ་འཐབ་བྲལ་ལ་སོགས་པ་འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཐེམ་སྐས་སུ་ཞུགས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་ན་བཟའི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་སྟེ་
en: At this point, the gods of Yāma, such as Suyāma, the king of the gods, noticed that the Blessed One was ascending the staircase, and they showered clouds of divine garments on him in worship.

source: བདེ་གཤེགས་ཁྱོད་ཀྱི་མཁྱེན་པ་མཐའ་ཡས་ཡངས་པས་སེམས་ཅན་བསམ་པ་མཁྱེན། །
en: “Sugata, your knowledge is vast and boundless, so you know the wishes of beings.

source: མཁའ་འདྲའི་ལམ་གྱི་ཆོས་གསུམ་དག་ལ་ཆགས་མེད་ཐམས་ཅད་མཁྱེན་པ་ཉིད། །
en: Your omniscience, vast as space and without attachment to the threefold path teachings,

source: སེམས་ཀྱི་འཇུག་པ་གཅིག་གིས་འགྲོ་བའི་སེམས་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་མཁྱེན། །
en: Fathoms the whole range of thoughts of sentient beings through a single mental event.

source: དེས་ན་སྲིད་པ་གསུམ་པོ་དག་ན་ལུས་ཅན་རྣམས་ཀྱིས་མཆོད་པར་འོས། །
en: Therefore, you deserve praise from everyone in all three existences.”

source: དེ་ནས་འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲང་བར་གྱུར་ཏོ། །
en: After the gods of Yāma had praised the Blessed One with this verse, they joined the procession to attend to him.

source: དེ་ནས་ལྷའི་རྒྱལ་པོ་རབ་དགའ་ལྡན་ལ་སོགས་པ་དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཐེམ་སྐས་སུ་ཞུགས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་སྟེ་
en: At this point, the gods of Tuṣita, such as Pramodita, the king of the gods, noticed that the Blessed One was ascending the staircase, and they showered clouds of divine jewels on him in worship.

source: གང་གི་སླད་དུ་སྒྲ་དང་ཡི་གེ་མ་མཆིས་གང་དུའང་རྒྱུ་བ་མ་མཆིས་པས། །
en: “Since phenomena are without sound or expression, without coming or going,

source: ཁྱོད་ཀྱིས་ཆོས་རྣམས་མི་གཡོ་ཡ་མ་བརླ་དང་སྒྱུ་མ་སྨིག་རྒྱུ་འདྲར་མཁྱེན་ནས
en: You know them to be without motion and untrue, like a mirage or hallucination.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་རྗེས་སེམས་ཅན་རྣམས་ལ་ཆེད་དུ་ཆོས་མཆོག་གསུངས་པས་ན། །
en: The Blessed One teaches the supreme Dharma out of compassion for the sake of beings.

source: ཆོས་ཀྱི་དངོས་པོའི་རང་བཞིན་མཁས་པ་བདག་མེད་གསུང་བའི་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །
en: We pay homage to the Victor who is skilled in the nature of phenomena and who teaches no self.”

source: དེ་ནས་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲང་ངོ་། །
en: After the gods of Tuṣita had praised the Blessed One with this verse, they joined the procession to attend to him.
